Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/national_government/standards_and_accountability/data_protection.html.txt.tmx
Source language: en
Languages: ga

source: The Office of the Data Protection Commissioner is responsible for upholding the privacy rights of individuals in relation to the processing of their personal data
ga: Tá Oifig an Choimisinéara Cosanta Sonraí freagrach as cearta príobháideachta gach duine a chosaint maidir le próiseáil a sonraí pearsanta

source: These rights are contained in the Data Protection Acts 1988 and 2003 (pdf)
ga: Cuimsítear na cearta seo sna hAchtanna um Chosaint Sonraí, 1988 agus 2003 (pdf)

source: The Acts state that information about you must be accurate, only made available to those that should have it and only used for specified purposes
ga: Luaitear sna hAchtanna nach mór go bhfuil faisnéis fút cruinn, nach mór go gcuirtear faisnéis faoi dhaoine ar fáil ach dóibh siúd ar cheart dóibh an fhaisnéis a bheith acu agus nár cheart an fhaisnéis a úsáid ach chun críocha sonraithe

source: You have the right to access personal information relating to you and have any errors corrected or, in some cases, have the information erased
ga: Tá an ceart agat chun faisnéis phearsanta a bhaineann leat a rochtain agus go gceartófar aon earráidí nó, i roinnt cásanna, go scriostar an fhaisnéis

source: If your information is being held for the purposes of direct marketing, you can have your details removed
ga: Má tá d’fhaisnéis á coimeád ar mhaithe le margaíocht dhíreach, féadfaidh tú iarraidh go mbainfear do shonraí

source: Data protection rights apply to information held on computer or in manual or paper files
ga: Baineann cearta um chosaint sonraí le faisnéis a choimeádtar ar ríomhaire nó i lámhleabhar nó i gcomhaid pháipéir

source: The Commissioner is appointed by the Government and is independent in the exercise of her functions
ga: Tá an Coimisinéir ceaptha ag an Rialtas agus bíonn sé/sí neamhspleách i bhfeidhmiú a f(h)eidhmeanna

source: Individuals who feel their rights are being infringed can complain to the Commissioner
ga: Féadfaidh daoine aonair a bhraitheann go bhfuil a gcearta á sárú gearán a dhéanamh leis an gCoimisinéir

source: She has powers to enforce the provisions of the Act
ga: Tá na cumhachtaí aige/aici chun forálacha an Achta a fhorfheidhmiú

source: If you suffer damage as a result of a breach of your data protection rights, you may sue for damages through the courts
ga: Má bhíonn tú thíos le díobháil thromchúiseach mar gheall gur sáraíodh do chearta um chosaint sonraí, féadfaidh tú agairt a dhéanamh le haghaidh damáistí trí na cúirteanna

source: The Commissioner also maintains a register, available for public inspection, giving general details about the data handling practices of many important data controllers, such as government departments and State-sector bodies, financial institutions, and any person or organisation who keeps sensitive types of personal data
ga: Coimeádann an Coimisinéir clár, chomh maith, atá ar fáil le haghaidh imscrúdú poiblí, a thugann sonraí ginearálta faoi chleachtais láimhseála sonraí go leor rialtóirí tábhachtacha sonraí, ar nós ranna rialtais agus comhlachtaí earnáil an Stáit, institiúidí airgeadais, agus aon duine nó eagraíocht a choimeádann saghsanna íogair de shonraí pearsanta

source: To access information relating to you, send a letter or email to the organisation or person holding your personal details and ask them for a copy of this information
ga: Chun faisnéis a bhaineann leat a rochtain, seol litir nó ríomhphost chuig an eagraíocht nó an duine a choimeádann do chuid sonraí pearsanta agus iarr orthu cóip den fhaisnéis a thabhairt duit

source: You should receive them within 40 calendar days of your request
ga: Ba cheart go bhfaighfeá an chóip laistigh de 40 lá féilire tar éis d’iarratas

source: You may have to pay a small fee of €6.35
ga: B’fhéidir go mbeidh ort táille bheag €6.35 a íoc

source: If you find that an organisation or person has details about you that are not factually correct, you can ask them to change or, in some cases, remove these details
ga: Má thugann tú faoi deara go bhfuil sonraí fút ag eagraíocht nó ag duine nach bhfuil i gceart go fíriciúil, féadfaidh tú iarraidh orthu iad a athrú nó, i roinnt cásanna, na sonraí a bhaint

source: If you feel that they do not have a valid reason for holding your personal details or that they have taken these details in an unfair way, you can ask them to change or remove these details
ga: Má bhraitheann tú nach bhfuil cúis bhailí acu do shonraí pearsanta a choimeád nó gur ghlac siad na sonraí seo ar bhealach éagórach, féadfaidh tú iarraidh orthu na sonraí seo a athrú nó a bhaint

source: You can also ask them not to use your personal details for purposes other than their main purpose
ga: Chomh maith leis sin, féadfaidh tú iarraidh orthu gan do shonraí pearsanta a úsáid ar chuspóirí eile seachas dá bpríomhchuspóir

source: Write to the organisation or person, explaining your concerns or outlining which details are incorrect
ga: Scríobh chuig an eagraíocht nó chuig an duine, mínigh do bhuarthaí nó tabhair cuntas ar cén sonraí atá mícheart

source: Within 40 days, they must do as you ask or explain why they will not do so
ga: Laistigh de 40 lá, caithfidh siad an méid a d’iarr tú orthu a dhéanamh nó a mhíniú cén fáth nach ndéanfaidh siad amhlaidh

source: Further information on your rights and how to obtain them is available on the Commissioner’s website
ga: Tá fáil ar bhreis faisnéise ar do chearta agus ar conas iad a fháil ar láithreán gréasáin an Choimisinéara

source: To make a complaint to the Data Protection Commissioner, simply write to or email the Commissioner explaining your case
ga: Chun gearán a dhéanamh leis an gCoimisinéir Cosanta Sonraí, ní gá ach ríomhphost a sheoladh nó scríobh chuig an gCoimisinéir agus do chás a mhíniú

source: You should include the following details:
ga: Ba cheart duit na sonraí a leanas a chur san áireamh:

source: • The name of the organisation or person you are complaining about
ga: • Ainm na heagraíochta nó an duine a bhfuil tú ag gearán fúthu

source: • The steps you have taken to have your concerns dealt with
ga: • Na bearta a ghlac tú go ndéileálfar le do bhuarthaí

source: • The details of any response you have received
ga: • Sonraí faoi aon fhreagairt a fuair tú

source: You should provide copies of any letters or emails exchanged between you and the organisation or person
ga: Ba cheart duit cóipeanna d’aon litreacha nó ríomhphoist a seoladh idir tú féin agus an eagraíocht nó an duine a sholáthar

source: If the Commissioner agrees with your complaint, she will try to make sure that the organisation or person obeys the law and puts matters right
ga: Má chomhaontaíonn an Coimisinéir le do ghearán, déanfaidh sí iarracht a chinntiú go gcloíonn an eagraíocht nó an duine leis an dlí agus go gcuireann siad na ceisteanna ina gceart

source: If the Data Protection Commissioner does not accept your complaint, you may appeal to the Circuit Court against her decision within 21 days
ga: Mura nglacann an Coimisinéir Cosanta Sonraí le do ghearán, féadfaidh tú achomharc a dhéanamh leis an gCúirt Chuarda i leith a cinnidh laistigh de 21 lá

source: Read more about complaining to the Data Protection Commissioner on the Commissioner’s website
ga: Féadfaidh tú breis faisnéise a léamh faoi ghearán a dhéanamh leis an gCoimisinéir Cosanta Sonraí ar láithreán gréasáin an Choimisinéra
